package com.p19015;

public abstract class Check extends Main {

    public static int check5(int animalcode){
        /* Η μέθοδος αυτή ελέγχει αν ο κωδικός ζώου που εισήγαγε ο χρήστης είναι έγκυρος, δήλαδη διαφορετικός από όλους τους
           άλλους μοναδικούς κωδικούς ζώων. Θέτω, λοιπόν, ένα int j ίσο με το 0. Με την παρακάτω επαναληπτική διαδικασία περνάω
           από όλα τα αντικείμενα της λίστας και με την if ελέγχω αν οι κωδικοί αυτών των αντικειμένων(των ζώων δηλαδή) ταυτίζονται με τον
           κωδικό που έδωσε ο χρήστης. Αν ταυτίζονται τότε το j γίνεται 1 και αυτό σημαίνει ότι ο κωδικός υπάρχει ήδη, άρα δεν είναι
           έγκυρος. Αν δεν ταυτίζονται τότε το j παραμένει 0. Ο έλεγχος του j πραγματοποιείται στη μέθοδο από την οποία καλέστηκε η check5. */

        int j = 0;

        for (Zoo animal : zooArrayList) {
            if (animal.getAnimalcode() == animalcode) {
                j = 1;
                break;
            }
        }

        return j;
    }
}
